<template>
	<div>
		<div>トップページ</div>
		<div><button href="#" @click="$router.push('test')">test</button></div>
		<div><button href="#" @click="$router.push('counter')">counter</button></div>
		<div><button href="#" @click="$router.push('reverse')">reverse</button></div>
	</div>
</template>

<script lang="ts">
	// ----------------------------------------------------------------
	// ----------------------------------------------------------------
	// ----------------------------------------------------------------

	import {Component, Vue,} from 'vue-property-decorator';

	// ----------------------------------------------------------------
	// ----------------------------------------------------------------
	// ----------------------------------------------------------------

	@Component({
		components: {},
	})
	export default class PageTop extends Vue{}

	// ----------------------------------------------------------------
	// ----------------------------------------------------------------
	// ----------------------------------------------------------------
</script>

<style lang="scss">
</style>
