<template>
	<div>
		<div>リバースページ</div>
		<div><button @click="reverseMessage">{{message}}</button></div>
	</div>
</template>

<script lang="ts">
	// ----------------------------------------------------------------
	// ----------------------------------------------------------------
	// ----------------------------------------------------------------

	import {Component, Vue,} from 'vue-property-decorator';

	// ----------------------------------------------------------------
	// ----------------------------------------------------------------
	// ----------------------------------------------------------------

	@Component({
		components: {
		},
	})
	export default class PageReverse extends Vue{
		private message: string = 'Hello Vue!';
		private reverseMessage(): void{
			this.message = this.message.split('').reverse().join('');
		}
	}

	// ----------------------------------------------------------------
	// ----------------------------------------------------------------
	// ----------------------------------------------------------------
</script>

<style lang="scss">
</style>
